## Imports

In [1]:
import pandas as pd

## Global Variables

In [ ]:
#read files into data frames
amazon_sale_report = pd.read_csv("data/Amazon Sale Report.csv")
cloud_warehouse_compersion = pd.read_csv("data/Cloud Warehouse Compersion Chart.csv")
expense_IIGF = pd.read_csv("data/Expense IIGF.csv")
international_sale_report = pd.read_csv("data/International sale Report.csv")
may_2022 = pd.read_csv("data/May-2022.csv")
pl_march_2021 = pd.read_csv("data/P  L March 2021.csv")
sale_report = pd.read_csv("data/Sale Report.csv")

C:\Users\Steven\AppData\Local\Temp\ipykernel_83680\697825074.py:1: DtypeWarning: Columns (23) have mixed types. Specify dtype option on import or set low_memory=False.
  amazon_sale_report = pd.read_csv("data/Amazon Sale Report.csv")

### Files top 2
(Remove later)
Used as a example to visualize rows and columns of each csv file.

In [12]:
amazon_sale_report.head(2)

,index,Order ID,Date,Status,Fulfilment,Sales Channel,ship-service-level,Style,SKU,Category,...,currency,Amount,ship-city,ship-state,ship-postal-code,ship-country,promotion-ids,B2B,fulfilled-by,Unnamed: 22
0,0,405-8078784-5731545,04-30-22,Cancelled,Merchant,Amazon.in,Standard,SET389,SET389-KR-NP-S,Set,...,INR,647.62,MUMBAI,MAHARASHTRA,400081.0,IN,NaN,False,Easy Ship,NaN
1,1,171-9198151-1101146,04-30-22,Shipped - Delivered to Buyer,Merchant,Amazon.in,Standard,JNE3781,JNE3781-KR-XXXL,kurta,...,INR,406.00,BENGALURU,KARNATAKA,560085.0,IN,Amazon PLCC Free-Financing Universal Merchant ...,False,Easy Ship,NaN

In [13]:
cloud_warehouse_compersion.head(2)

   index                     Shiprocket        Unnamed: 1           INCREFF
0      0                          Heads  Price (Per Unit)  Price (Per Unit)
1      1  Inbound (Fresh Stock and RTO)             ₹4.00                 4

In [14]:
expense_IIGF.head(2)

   index Recived Amount Unnamed: 1     Expance Unnamed: 3
0      0     Particular     Amount  Particular     Amount
1      1       06-19-22       1000   Large Bag        380

In [15]:
international_sale_report.head(2)

,index,DATE,Months,CUSTOMER,Style,SKU,Size,PCS,RATE,GROSS AMT
0,0,06-05-21,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-L,L,1.00,616.56,617.00
1,1,06-05-21,Jun-21,REVATHY LOGANATHAN,MEN5004,MEN5004-KR-XL,XL,1.00,616.56,617.00

In [16]:
may_2022.head(2)

,index,Sku,Style Id,Catalog,Category,Weight,TP,MRP Old,Final MRP Old,Ajio MRP,Amazon MRP,Amazon FBA MRP,Flipkart MRP,Limeroad MRP,Myntra MRP,Paytm MRP,Snapdeal MRP
0,0,Os206_3141_S,Os206_3141,Moments,Kurta,0.3,538,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295
1,1,Os206_3141_M,Os206_3141,Moments,Kurta,0.3,538,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295

In [17]:
pl_march_2021.head(2)

,index,Sku,Style Id,Catalog,Category,Weight,TP 1,TP 2,MRP Old,Final MRP Old,Ajio MRP,Amazon MRP,Amazon FBA MRP,Flipkart MRP,Limeroad MRP,Myntra MRP,Paytm MRP,Snapdeal MRP
0,0,Os206_3141_S,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295
1,1,Os206_3141_M,Os206_3141,Moments,Kurta,0.3,538,435.78,2178,2295,2295,2295,2295,2295,2295,2295,2295,2295

In [18]:
sale_report.head(2)

   index     SKU Code Design No.  Stock       Category Size Color
0      0  AN201-RED-L      AN201    5.0  AN : LEGGINGS    L   Red
1      1  AN201-RED-M      AN201    5.0  AN : LEGGINGS    M   Red

## Functions

## Main Funciton

In [ ]:
def main():
    pass

if __name__ == "__main__":
    main()